<template>
  <view>
    <YSteps lineNum="0" :infoList="list"></YSteps>
  </view>
</template>

<script setup lang="ts">
import YSteps from "components/Y-Steps/Y-Steps.vue";
const list = [
  {
    date: "2020-1-4",
    info: "的",
    createByName: "张三",
    auditOpinionFlag: 2,
    createTime: "2020-1-4",
    auditOpinion:
      "看见阿萨德和封口机撒的护肤科技撒地方即可撒地方就开始，内容这里是内容这里是内容这里是内",
    bgColor: "#27CB0D",
  },

  {
    date: "2020-1-4",
    info: "看见阿萨德和封口机撒的护肤科技撒地方即可撒地方就开始",
    bgColor: "#EFAD03",
  },

  {
    date: "2020-1-4",
    info: "这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容",
  },
  {
    date: "2020-1-4",
    info: "这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容",
  },
  {
    date: "2020-1-4",
    info: "这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容",
  },
  {
    date: "2020-1-4",
    info: "这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容",
  },
  {
    date: "2020-1-4",
    info: "这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容",
  },
  {
    date: "2020-1-4",
    info: "这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容这里是内容",
  },
];
</script>

<style lang="less"></style>
